; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v7 ?v13)
             (pred_6 ?v2 ?v4)
             (pred_7 ?v7 ?v4)
             (pred_10 ?v8 ?v7 )
	     (pred_5 ?v7)
             (pred_12 ?v12)
             (pred_4 ?v2)
             (pred_1 ?v4)
             (pred_8 ?v7)
             (pred_2 ?v2)
             (pred_3 ?v7)
             (pred_9 ))



(:action op_3
:parameters (?v9 ?v1 ?v3 ?v6)
:precondition (and (pred_12 ?v9) (pred_12 ?v1) (pred_4 ?v3) (pred_1 ?v6)
          (pred_11 ?v9 ?v1) (pred_6 ?v3 ?v6)
                   (pred_7 ?v1 ?v6) (pred_5 ?v9) 
                   (pred_8 ?v1) (pred_2 ?v3))
:effect (and  (pred_3 ?v1) (not (pred_8 ?v1))))


(:action op_2
:parameters (?v9 ?v5)
:precondition (and (pred_12 ?v9) (pred_12 ?v5)
               (pred_5 ?v9) (pred_11 ?v9 ?v5) (pred_3 ?v5))
:effect (and (pred_5 ?v5) (not (pred_5 ?v9))))

(:action op_5
:parameters (?v9 ?v3)
:precondition (and (pred_12 ?v9) (pred_4 ?v3) 
                  (pred_5 ?v9) (pred_10 ?v3 ?v9) (pred_9 ))
:effect (and (pred_2 ?v3)
   (not (pred_10 ?v3 ?v9)) (not (pred_9 ))))


(:action op_1
:parameters (?v9 ?v11 ?v10)
:precondition (and (pred_12 ?v9) (pred_4 ?v11) (pred_4 ?v10)
                  (pred_5 ?v9) (pred_2 ?v10) (pred_10 ?v11 ?v9))
:effect (and (pred_2 ?v11) (pred_10 ?v10 ?v9)
        (not (pred_2 ?v10)) (not (pred_10 ?v11 ?v9))))

(:action op_4
:parameters (?v9 ?v3)
:precondition (and (pred_12 ?v9) (pred_4 ?v3) 
                  (pred_5 ?v9) (pred_2 ?v3))
:effect (and (pred_9 ) (pred_10 ?v3 ?v9) (not (pred_2 ?v3)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_14 obj_28 obj_10 obj_04 obj_16 obj_01 obj_21 obj_25 obj_13 obj_03 obj_29 obj_12 obj_22 obj_20 obj_17 obj_26 obj_11 obj_24 obj_02 obj_23 obj_05 obj_08 obj_27 obj_30
    obj_15 obj_19
    obj_18 obj_09 obj_06
    )

    (:init
       (pred_9)

       (pred_12 obj_07)
       (pred_12 obj_14)
       (pred_12 obj_28)
       (pred_12 obj_10)
       (pred_12 obj_04)
       (pred_12 obj_16)
       (pred_12 obj_01)
       (pred_12 obj_21)
       (pred_12 obj_25)
       (pred_12 obj_13)
       (pred_12 obj_03)
       (pred_12 obj_29)
       (pred_12 obj_12)
       (pred_12 obj_22)
       (pred_12 obj_20)
       (pred_12 obj_17)
       (pred_12 obj_26)
       (pred_12 obj_11)
       (pred_12 obj_24)
       (pred_12 obj_02)
       (pred_12 obj_23)
       (pred_12 obj_05)
       (pred_12 obj_08)
       (pred_12 obj_27)
       (pred_12 obj_30)
       (pred_1 obj_15)
       (pred_1 obj_19)
       (pred_4 obj_18)
       (pred_4 obj_09)
       (pred_4 obj_06)

       (pred_11 obj_07 obj_16)
       (pred_11 obj_07 obj_14)
       (pred_11 obj_14 obj_01)
       (pred_11 obj_14 obj_28)
       (pred_11 obj_14 obj_07)
       (pred_11 obj_28 obj_21)
       (pred_11 obj_28 obj_10)
       (pred_11 obj_28 obj_14)
       (pred_11 obj_10 obj_25)
       (pred_11 obj_10 obj_04)
       (pred_11 obj_10 obj_28)
       (pred_11 obj_04 obj_13)
       (pred_11 obj_04 obj_10)
       (pred_11 obj_16 obj_03)
       (pred_11 obj_16 obj_01)
       (pred_11 obj_16 obj_07)
       (pred_11 obj_01 obj_29)
       (pred_11 obj_01 obj_21)
       (pred_11 obj_01 obj_14)
       (pred_11 obj_01 obj_16)
       (pred_11 obj_21 obj_12)
       (pred_11 obj_21 obj_25)
       (pred_11 obj_21 obj_28)
       (pred_11 obj_21 obj_01)
       (pred_11 obj_25 obj_22)
       (pred_11 obj_25 obj_13)
       (pred_11 obj_25 obj_10)
       (pred_11 obj_25 obj_21)
       (pred_11 obj_13 obj_20)
       (pred_11 obj_13 obj_04)
       (pred_11 obj_13 obj_25)
       (pred_11 obj_03 obj_17)
       (pred_11 obj_03 obj_29)
       (pred_11 obj_03 obj_16)
       (pred_11 obj_29 obj_26)
       (pred_11 obj_29 obj_12)
       (pred_11 obj_29 obj_01)
       (pred_11 obj_29 obj_03)
       (pred_11 obj_12 obj_11)
       (pred_11 obj_12 obj_22)
       (pred_11 obj_12 obj_21)
       (pred_11 obj_12 obj_29)
       (pred_11 obj_22 obj_24)
       (pred_11 obj_22 obj_20)
       (pred_11 obj_22 obj_25)
       (pred_11 obj_22 obj_12)
       (pred_11 obj_20 obj_02)
       (pred_11 obj_20 obj_13)
       (pred_11 obj_20 obj_22)
       (pred_11 obj_17 obj_23)
       (pred_11 obj_17 obj_26)
       (pred_11 obj_17 obj_03)
       (pred_11 obj_26 obj_05)
       (pred_11 obj_26 obj_11)
       (pred_11 obj_26 obj_29)
       (pred_11 obj_26 obj_17)
       (pred_11 obj_11 obj_08)
       (pred_11 obj_11 obj_24)
       (pred_11 obj_11 obj_12)
       (pred_11 obj_11 obj_26)
       (pred_11 obj_24 obj_27)
       (pred_11 obj_24 obj_02)
       (pred_11 obj_24 obj_22)
       (pred_11 obj_24 obj_11)
       (pred_11 obj_02 obj_30)
       (pred_11 obj_02 obj_20)
       (pred_11 obj_02 obj_24)
       (pred_11 obj_23 obj_05)
       (pred_11 obj_23 obj_17)
       (pred_11 obj_05 obj_08)
       (pred_11 obj_05 obj_26)
       (pred_11 obj_05 obj_23)
       (pred_11 obj_08 obj_27)
       (pred_11 obj_08 obj_11)
       (pred_11 obj_08 obj_05)
       (pred_11 obj_27 obj_30)
       (pred_11 obj_27 obj_24)
       (pred_11 obj_27 obj_08)
       (pred_11 obj_30 obj_02)
       (pred_11 obj_30 obj_27)
       (pred_8 obj_11)
       (pred_8 obj_10)
       (pred_8 obj_02)
       (pred_7  obj_11 obj_15)
       (pred_7  obj_10 obj_19)
       (pred_7  obj_02 obj_15)
       (pred_3 obj_07)
       (pred_3 obj_14)
       (pred_3 obj_28)
       (pred_3 obj_04)
       (pred_3 obj_16)
       (pred_3 obj_01)
       (pred_3 obj_21)
       (pred_3 obj_25)
       (pred_3 obj_13)
       (pred_3 obj_03)
       (pred_3 obj_29)
       (pred_3 obj_12)
       (pred_3 obj_22)
       (pred_3 obj_20)
       (pred_3 obj_17)
       (pred_3 obj_26)
       (pred_3 obj_24)
       (pred_3 obj_23)
       (pred_3 obj_05)
       (pred_3 obj_08)
       (pred_3 obj_27)
       (pred_3 obj_30)

       (pred_6  obj_18 obj_15)
       (pred_6  obj_09 obj_19)
       (pred_6  obj_06 obj_19)
       (pred_10 obj_18 obj_04)
       (pred_10 obj_09 obj_01)
       (pred_10 obj_06 obj_12)
       (pred_5 obj_21)
    )

    (:goal (and
       (pred_10 obj_18 obj_14)
       (pred_10 obj_06 obj_13)
    ))
(:constraints
  (always (not (pred_5 obj_25)))
)
)

; plan
1. (op_2 obj_21 obj_01)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_01)
   goals met: 0 of 2
2. (op_5 obj_01 obj_09)
   deleted: (pred_10 obj_09 obj_01) (pred_9)
   added: (pred_2 obj_09)
   goals met: 0 of 2
3. (op_2 obj_01 obj_14)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_14)
   goals met: 0 of 2
4. (op_4 obj_14 obj_09)
   deleted: (pred_2 obj_09)
   added: (pred_9) (pred_10 obj_09 obj_14)
   goals met: 0 of 2
5. (op_2 obj_14 obj_28)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_28)
   goals met: 0 of 2
6. (op_2 obj_28 obj_21)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_21)
   goals met: 0 of 2
7. (op_2 obj_21 obj_12)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_12)
   goals met: 0 of 2
8. (op_5 obj_12 obj_06)
   deleted: (pred_10 obj_06 obj_12) (pred_9)
   added: (pred_2 obj_06)
   goals met: 0 of 2
9. (op_2 obj_12 obj_21)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_21)
   goals met: 0 of 2
10. (op_2 obj_21 obj_28)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_28)
   goals met: 0 of 2
11. (op_3 obj_28 obj_10 obj_06 obj_19)
   deleted: (pred_8 obj_10)
   added: (pred_3 obj_10)
   goals met: 0 of 2
12. (op_2 obj_28 obj_14)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_14)
   goals met: 0 of 2
13. (op_4 obj_14 obj_06)
   deleted: (pred_2 obj_06)
   added: (pred_9) (pred_10 obj_06 obj_14)
   goals met: 0 of 2
14. (op_2 obj_14 obj_28)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_28)
   goals met: 0 of 2
15. (op_2 obj_28 obj_10)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_10)
   goals met: 0 of 2
16. (op_2 obj_10 obj_04)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_04)
   goals met: 0 of 2
17. (op_5 obj_04 obj_18)
   deleted: (pred_10 obj_18 obj_04) (pred_9)
   added: (pred_2 obj_18)
   goals met: 0 of 2
18. (op_2 obj_04 obj_10)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_10)
   goals met: 0 of 2
19. (op_2 obj_10 obj_28)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_28)
   goals met: 0 of 2
20. (op_2 obj_28 obj_14)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_14)
   goals met: 0 of 2
21. (op_1 obj_14 obj_06 obj_18)
   deleted: (pred_2 obj_18) (pred_10 obj_06 obj_14)
   added: (pred_2 obj_06) (pred_10 obj_18 obj_14)
   goals met: 1 of 2
22. (op_2 obj_14 obj_28)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_28)
   goals met: 1 of 2
23. (op_2 obj_28 obj_10)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_10)
   goals met: 1 of 2
24. (op_2 obj_10 obj_04)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_04)
   goals met: 1 of 2
25. (op_2 obj_04 obj_13)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_13)
   goals met: 1 of 2
26. (op_4 obj_13 obj_06)
   deleted: (pred_2 obj_06)
   added: (pred_9) (pred_10 obj_06 obj_13)
   goals met: 2 of 2
